//
//  开发笔记.h
//  WeiBo
//
//  Created by 王潇 on 16/4/10.
//  Copyright © 2016年 王潇. All rights reserved.
//

#ifndef _____h
#define _____h

/*******************************************************************************/
/*								1. 添加子控制器								   */
/*******************************************************************************/
文件:	MainViewController.swift
方法:	private func addChildViewController(childController: UIViewController, title: String, imageName: String)

/*******************************************************************************/
/*								1. 命名空间									   */
/*******************************************************************************/


#endif /* _____h */
